app/Models/DetailInputModel.php

    public function getAllData($id)
    {
        return $this->select('master_input.barcode_real, detail_input.*')
            ->where('detail_input.id_data', $id)
            ->join('master_input', 'master_input.id_data = detail_input.id_data')
            ->groupBy('id_input')
            ->findAll();
---
SELECT *
FROM `detail_input`
JOIN `master_input` ON `master_input`.`id_data` = `detail_input`.`id_data`
WHERE `detail_input`.`id_data` = '2'