app/Models/MasterPOModel.php

    public function getPo()
    {
        return $this->select('id_po,po,buyer')
            ->orderBy('po')
            ->groupBy('id_po')
            ->findAll();
---
SELECT `id_po`, `po`, `buyer`
FROM `master_po`
GROUP BY `id_po`
ORDER BY `po`

    public function cekDuplikatPO($validate)
    {
        $query = $this->where('po', $validate['po'])
            ->where('buyer ', $validate['buyer'])
            ->first();
---
SELECT *
FROM `master_po`
WHERE `po` = 'bira'
AND `buyer` = 'b2'
 LIMIT 1

    public function getDetailPO($id_po)
    {
        return $this->select('master_po.*, master_pdk.pdk, master_pdk.no_order')
            ->where('master_po.id_po', $id_po)
            ->join('master_pdk', 'master_pdk.id_po = master_po.id_po')
            ->findAll();
---
SELECT `master_po`.*, `master_pdk`.`pdk`, `master_pdk`.`no_order`
FROM `master_po`
JOIN `master_pdk` ON `master_pdk`.`id_po` = `master_po`.`id_po`
WHERE `master_po`.`id_po` = '2'

    public function getNomorPO($id_po)
    {
        return $this->select('po')
            ->where('id_po', $id_po)
            ->get()
            ->getRowArray()['po'];
---
SELECT `id_po`
FROM `master_po`
WHERE `id_po` = '2'

    public function getIdPO($id_po)
    {
        return $this->select('id_po')
            ->where('id_po', $id_po)
            ->get()
            ->getRowArray()['id_po'];
---
SELECT `id_po`
FROM `master_po`
WHERE `id_po` = '2'