app/Models/MasterInputModel.php

SELECT `master_pdk`.`id_pdk`, `master_pdk`.`pdk`, `master_input`.*
FROM `master_input`
JOIN `master_pdk` ON `master_pdk`.`id_pdk` = `master_input`.`id_pdk`
WHERE `master_pdk`.`id_pdk` = '1'
---
    public function getDetailPDK($id_pdk)
    {
        return $this->select('master_pdk.id_pdk, master_pdk.pdk, master_input.*')
            ->where('master_pdk.id_pdk', $id_pdk)
            ->join('master_pdk', 'master_pdk.id_pdk = master_input.id_pdk')
            ->groupBy('master_input.id_data')
            ->findAll();

SELECT `id_pdk`
FROM `master_input`
WHERE `id_data` = '2'
 LIMIT 1
---
    public function getIdPdk($idbarcode)
    {
        $id = $this->select('id_pdk')->where('id_data', $idbarcode)->first();