app/Models/MasterPDKModel.php

SELECT `master_po`.*, `master_pdk`.`id_pdk`, `master_pdk`.`pdk`, `master_pdk`.`no_order`
FROM `master_pdk`
JOIN `master_po` ON `master_pdk`.`id_po` = `master_po`.`id_po`
WHERE `master_po`.`id_po` = '2'
---
    public function getDetailPO($id_po)
    {
        return $this->select('master_po.*, master_pdk.id_pdk, master_pdk.pdk, master_pdk.no_order')
        ->where('master_po.id_po', $id_po)
        ->join('master_po', 'master_pdk.id_po = master_po.id_po')
        ->findAll();

SELECT `pdk`
FROM `master_pdk`
WHERE `id_pdk` = '1'
---
    public function getPDK($id_pdk)
    {
        return $this->select('pdk')
        ->where('id_pdk', $id_pdk)
        ->get()
        ->getRowArray()['pdk'];

SELECT `id_pdk`
FROM `master_pdk`
WHERE `id_pdk` = '1'
---
    public function getIdPDK($id_pdk)
    {
        return $this->select('id_pdk')
        ->where('id_pdk', $id_pdk)
        ->get()
        ->getRowArray()['id_pdk'];