app/Models/UserModel.php

    public function login($username, $password)
    {
        $user = $this->where(['username' => $username, 'password' => $password])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'aks'
AND `password` = 'aks'
 LIMIT 1